/**
 ******************************************************************************
 * @file     02_key.ino
 * @author   正点原子团队(正点原子)
 * @version  V1.0
 * @date     2023-12-01
 * @brief    KEY按键实验
 * @license  Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ******************************************************************************
 * 
 * 实验目的：学习GPIO作为输入的使用，检测KEY按键状态
 *
 * 硬件资源及引脚分配： 
 * 1, LED --> ESP32S3 IO
 *    LED --> IO1
 * 2, KEY --> ESP32S3 IO
 *    KEY --> IO0
 * 
 * 实验现象：
 * 1, 按下KEY，LED指示灯亮，不按下KEY，LED指示灯灭
 * 
 * 注意事项：
 * 无
 * 
 ******************************************************************************
 * 
 * 实验平台:正点原子 ESP32S3 开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com/forum.php
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 *
 ******************************************************************************
 */

#include "led.h"
#include "key.h"


/**
 * @brief    当程序开始执行时，将调用setup()函数，通常用来初始化变量、函数等
 * @param    无
 * @retval   无
 */
void setup() 
{
    led_init();     /* LED初始化 */
    key_init();     /* KEY初始化 */
}

/**
 * @brief    循环函数，通常放程序的主体或者需要不断刷新的语句
 * @param    无
 * @retval   无
 */
void loop() 
{
    if (KEY == 0)     /* 读取KEY状态,如果按下KEY */
    {
        delay(10);

        if (KEY == 0)
        {
          LED(0);     /* LED引脚输出接低电平,点亮 */
        }
    }
    else              /* 读取KEY状态,如果KEY没有按下 */
    {
        LED(1);       /* LED引脚输出接高电平,熄灭 */
    }
}
